#pragma once
#include "ui_WorkAttendanceSys.h"
#include <QtWidgets/QDialog>
#include"../Interface/Interface.h"

class WorkAttendanceSys : public QDialog, public Interface
{
    Q_OBJECT

public:
          WorkAttendanceSys(QWidget* parent = nullptr);
          ~WorkAttendanceSys();

private:
          /*------------------------WorkAttendanceSys考勤系统初始化-----------------------------*/
          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统常驻程序
          * @name : initWorkAttendanceSys
          * @funtion : 提供操作槽SLOT供给signal信号调用
          *------------------------------------------------------------------------------------------------------*/
          void initWorkAttendanceSys();

          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统初始化下拉框
          * @name :  initDepartmentSetting
          * @funtion : 初始化下拉框用于部门的选择
          *------------------------------------------------------------------------------------------------------*/
          void initDepartmentSetting();

          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统进度条初始化
          * @name :  initProcessBarSetting
          * @funtion : 初始化进度条的信息
          *------------------------------------------------------------------------------------------------------*/
          void initProcessBarSetting();

private slots:
          /*------------------------------------------------------------------------------------------------------
          * 视频流的关闭开关
          * @name : videoStreamClose
          * @funtion : 提供操作槽SLOT供给signal信号调用
          *------------------------------------------------------------------------------------------------------*/
          void videoStreamClose();

          /*------------------------------------------------------------------------------------------------------
           * 在训练模型时作为训练集的拍照开关
           * @name : takePictureForTranning
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void takePictureForTranning();

          /*------------------------------------------------------------------------------------------------------
           * 开始使用训练模型进行训练集的训练
           * @name : initModelTranning
           * @funtion : 提供操作槽SLOT供给signal信号调用
           * @Correction: 2022-7-29 修复无法宽字符无法正常输入数据库的bug
           *------------------------------------------------------------------------------------------------------*/
          void initModelTranning();

          /*------------------------------------------------------------------------------------------------------
           * 保存当前的照片图像
           * @name : savePicture
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void savePicture();

          /*------------------------------------------------------------------------------------------------------
           * 舍弃当前的照片图像
           * @name : ignorePicture
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void ignorePicture();

          /*------------------------------------------------------------------------------------------------------
           * 摁下当前开关启动人脸的训练程序
           * @name : registerEmployee
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void registerEmployee();

private:
          /*------------------------------------------------------------------------------------------------------
           * 信号槽的设置程序
           * @name : connectSlotSet
           * @funtion : 设置空间和函数的捆绑关系
           *------------------------------------------------------------------------------------------------------*/
          void connectSlotSet();

private:
          /*------------------WorkAttendanceSys考勤系统MYSQL操作指令-------------------------*/
          std::string m_SelectDepartment = "SELECT Department FROM departmenttable";

private:
          Ui::WorkAttendanceSys ui;
          std::vector<std::thread> m_threadPool;
};
