#pragma once
#include "ui_WorkAttendanceSys.h"
#include "ui_WorkAttendanceAdmin.h"
#include <QtWidgets/QDialog>
#include"../Interface/Interface.h"

class WorkAttendanceSys : public QDialog, public Interface
{
    Q_OBJECT

public:
          WorkAttendanceSys(QWidget* parent = nullptr);
          ~WorkAttendanceSys();

private:
          /*--------------------------WorkAttendanceSys考勤系统初始化------------------------------*/
          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统按钮设定
          * @name : initButtonSetting
          * @funtion : 提供操作槽SLOT供给signal信号调用
          *------------------------------------------------------------------------------------------------------*/
          void initButtonSetting();

          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统常驻程序
          * @name : initWorkAttendanceSys
          * @funtion : 提供操作槽SLOT供给signal信号调用
          *------------------------------------------------------------------------------------------------------*/
          void initWorkAttendanceSys();

          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统初始化下拉框
          * @name :  initDepartmentSetting
          * @funtion : 初始化下拉框用于部门的选择
          *------------------------------------------------------------------------------------------------------*/
          void initDepartmentSetting();

          /*------------------------------------------------------------------------------------------------------
          * @WorkAttendanceSys考勤系统进度条初始化
          * @name :  initProcessBarSetting
          * @funtion : 初始化进度条的信息
          *------------------------------------------------------------------------------------------------------*/
          void initProcessBarSetting();

private slots:
          /*----------------------WorkAttendanceSys考勤系统按钮槽函数---------------------------*/
          /*------------------------------------------------------------------------------------------------------
          * 槽函数类别---关闭视频流和其他的线程
          * @name : closeVideoStream
          * @funtion : 提供操作槽SLOT供给signal信号调用
          * @Correction: 2022-8-1 可能存在有的线程卡在死循环中无法关闭的bug(现在还存在)
          *------------------------------------------------------------------------------------------------------*/
          void closeVideoStream();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---向训练线程传递信号拍照信号
           * @name : takePictureFromVideo
           * @funtion : 提供操作槽SLOT供给signal信号调用，拍照时暂停主显示线程以方便客户查看
           * @Correction : 2022-7-30 只有摁下拍摄按钮之后才可以选择图像的保存逻辑
           *                                                没有做出保存决定之前不可拍摄下一张照片
           *------------------------------------------------------------------------------------------------------*/
          void takePictureFromVideo();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---根据训练集开启人脸训练模式
           * @name : initTranningProcess
           * @funtion : 提供操作槽SLOT供给signal信号调用
           * @Correction: 2022-7-29 修复无法宽字符无法正常输入数据库的bug
           *------------------------------------------------------------------------------------------------------*/
          void initTranningProcess();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---保存当前的照片图像(仅限训练)
           * @name : savePictureForTranning
           * @funtion : 提供操作槽SLOT供给signal信号调用
           * @Correction : 2022-7-30 只有摁下拍摄按钮之后才可以选择继续拍照
           *                                                没有拍照之前不可以选择保存逻辑
           *------------------------------------------------------------------------------------------------------*/
          void savePictureForTranning();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---舍弃当前的照片图像(仅限训练)
           * @name : ignorePicture
           * @funtion : 提供操作槽SLOT供给signal信号调用
           * @Correction : 2022-7-30 只有摁下拍摄按钮之后才可以选择继续拍照
           *                                                没有拍照之前不可以选择保存逻辑
           *------------------------------------------------------------------------------------------------------*/
          void ignorePictureForTranning();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---开启人脸训练模式，从拍照线程中获取图片并加入训练集
           * @name : tranningSetInputFromVideo
           * @funtion : 提供操作槽SLOT供给signal信号调用
           * @Correction : 2022-7-30 启动训练拍照程序之后系统允许按钮的操作
           *------------------------------------------------------------------------------------------------------*/
          void tranningSetInputFromVideo();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---摁下当前开关启动用户的人脸登录系统(开始人脸识别)
           * @name : employeeAttendanceInterface
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void employeeAttendanceInterface();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---摁下当前开关启动用户的人脸登出系统(开始人脸识别)
           * @name : employeeSignalOutInterface
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void employeeSignalOutInterface();

          /*------------------------------------------------------------------------------------------------------
           * 槽函数类别---摁下当前开关向管理员账户申请注册权限
           * @name : employeeAskPremitInterface
           * @funtion : 提供操作槽SLOT供给signal信号调用
           *------------------------------------------------------------------------------------------------------*/
          void employeeAskPremitInterface();

private:
          /*------------------------------------------------------------------------------------------------------
           * 信号槽的设置程序
           * @name : connectSlotSet
           * @funtion : 设置空间和函数的捆绑关系
           *------------------------------------------------------------------------------------------------------*/
          void connectSlotSet();

          /*------------------------------------------------------------------------------------------------------
           * 删除打开普通和ADMIN系统UI
           * @name : deleteSysUi
           * @funtion : 删除打开普通和ADMIN系统UI
           *------------------------------------------------------------------------------------------------------*/
          void deleteSysUi();

private:
          /*------------------WorkAttendanceSys考勤系统MYSQL操作指令-------------------------*/
          std::string m_SelectDepartment = "SELECT Department FROM departmenttable";

private:
          QDateTime* m_globalTimer = nullptr;                  //全局时钟系统
          Ui::WorkAttendanceSys *ui_sys;                           //人脸系统主系统
          Ui::WorkAttendanceAdmin* ui_admin = nullptr;  //人脸系统ADMIN界面
          std::vector<std::thread> m_threadPool;
};